In [1]:
import sqlite3
import csv
import pandas as pd
import os
import numpy as np

In [ ]:
articles = {'id': 'john','john',''}

In [4]:
d = {'user': ['john','john','john','lori','mike'], 'time': ['4', '5', '6','7','8'], 'article': [7, 8, 9, 11, 2]}

In [5]:
df2 = pd.DataFrame(d)

In [6]:
df2

   user time  article
0  john    4        7
1  john    5        8
2  john    6        9
3  lori    7       11
4  mike    8        2

In [7]:
conn = sqlite3.connect('aritcles.sqlite')
cur = conn.cursor()

In [10]:
cur.execute('''DROP TABLE IF EXISTS articles''') 
cur.execute('''
            CREATE TABLE articles(
                id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
                user TEXT,
                time TEXT,
                article INTEGER)
                ''')
conn.commit()

In [11]:
for index, row in df2.iterrows():
    try:
        cur.execute('''
                INSERT INTO articles(
                user,
                time,
                article
                ) VALUES (?,?,?)''',(row[0],row[1],row[2])
               )
    except sqlite3.Error as e:
        print(e)
conn.commit()

In [14]:
trial = pd.read_sql_query("SELECT * FROM articles", conn)
trial

   id  user time  article
0   1  john    4        7
1   2  john    5        8
2   3  john    6        9
3   4  lori    7       11
4   5  mike    8        2

In [ ]:
SELECT articles.user, count(articles.article) AS count
FROM aritcles
GROUP BY articles.user
ORDER BY count

In [ ]:
pd.read_sql_query('')

In [34]:
cur.execute('''DROP TABLE IF EXISTS sorting''') 
cur.execute('''CREATE TABLE sorting AS
                SELECT articles.user, count(articles.article) AS counter
                FROM articles
                GROUP BY articles.user
                WHERE articles.counter = 1              
            ''')

conn.commit()

OperationalError: near "WHERE": syntax error

In [23]:
trial2 = pd.read_sql_query("SELECT * FROM sorting", conn)
trial2

   user  count
0  john      3